Microchip-MPLAB-Harmony/net/apps/snmpv3_sdcard_fatfs/firmware/src/packs/ATSAME70Q19B_DFP/atsame70q19b.h
/**
 * \brief Header file for SAME70Q19B
 *
 * Copyright (c) 2017-2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-02-09T02:00:00Z */
#ifndef SAME70Q19B_H
#define SAME70Q19B_H

/** \addtogroup SAME70Q19B_definitions SAME70Q19B definitions
  This file defines all structures and symbols for SAME70Q19B:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
 *  @{
 */

#ifdef __cplusplus
 extern "C" {
#endif

#include <stdint.h>

/** \addtogroup SAME70Q19B_cmsis CMSIS Definitions
 *  @{
 */
/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR SAME70Q19B                                         */
/* ************************************************************************** */
/** Interrupt Number Definition */
typedef enum IRQn
{
/******  CORTEX-7 Processor Exceptions Numbers ******************************/
  Reset_IRQn                = -15, /**< -15 Reset Vector, invoked on Power up and warm reset */
  NonMaskableInt_IRQn       = -14, /**< -14 Non maskable Interrupt, cannot be stopped or preempted */
  HardFault_IRQn            = -13, /**< -13 Hard Fault, all classes of Fault    */
  MemoryManagement_IRQn     = -12, /**< -12 Memory Management, MPU mismatch, including Access Violation and No Match */
  BusFault_IRQn             = -11, /**< -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault */
  UsageFault_IRQn           = -10, /**< -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition */
  SVCall_IRQn               =  -5, /**< -5  System Service Call via SVC instruction */
  DebugMonitor_IRQn         =  -4, /**< -4  Debug Monitor                       */
  PendSV_IRQn               =  -2, /**< -2  Pendable request for system service */
  SysTick_IRQn              =  -1, /**< -1  System Tick Timer                   */
/******  SAME70Q19B specific Interrupt Numbers ***********************************/
  SUPC_IRQn                 =   0, /**< 0   Supply Controller (SUPC)            */
  RSTC_IRQn                 =   1, /**< 1   Reset Controller (RSTC)             */
  RTC_IRQn                  =   2, /**< 2   Real-time Clock (RTC)               */
  RTT_IRQn                  =   3, /**< 3   Real-time Timer (RTT)               */
  WDT_IRQn                  =   4, /**< 4   Watchdog Timer (WDT)                */
  PMC_IRQn                  =   5, /**< 5   Power Management Controller (PMC)   */
  EFC_IRQn                  =   6, /**< 6   Embedded Flash Controller (EFC)     */
  UART0_IRQn                =   7, /**< 7   Universal Asynchronous Receiver Transmitter (UART0) */
  UART1_IRQn                =   8, /**< 8   Universal Asynchronous Receiver Transmitter (UART1) */
  PIOA_IRQn                 =  10, /**< 10  Parallel Input/Output Controller (PIOA) */
  PIOB_IRQn                 =  11, /**< 11  Parallel Input/Output Controller (PIOB) */
  PIOC_IRQn                 =  12, /**< 12  Parallel Input/Output Controller (PIOC) */
  USART0_IRQn               =  13, /**< 13  Universal Synchronous Asynchronous Receiver Transmitter (USART0) */
  USART1_IRQn               =  14, /**< 14  Universal Synchronous Asynchronous Receiver Transmitter (USART1) */
  USART2_IRQn               =  15, /**< 15  Universal Synchronous Asynchronous Receiver Transmitter (USART2) */
  PIOD_IRQn                 =  16, /**< 16  Parallel Input/Output Controller (PIOD) */
  PIOE_IRQn                 =  17, /**< 17  Parallel Input/Output Controller (PIOE) */
  HSMCI_IRQn                =  18, /**< 18  High Speed MultiMedia Card Interface (HSMCI) */
  TWIHS0_IRQn               =  19, /**< 19  Two-wire Interface High Speed (TWIHS0) */
  TWIHS1_IRQn               =  20, /**< 20  Two-wire Interface High Speed (TWIHS1) */
  SPI0_IRQn                 =  21, /**< 21  Serial Peripheral Interface (SPI0)  */
  SSC_IRQn                  =  22, /**< 22  Synchronous Serial Controller (SSC) */
  TC0_CH0_IRQn              =  23, /**< 23  Timer/Counter 0 Channel 0 (TC0)     */
  TC0_CH1_IRQn              =  24, /**< 24  Timer/Counter 0 Channel 1 (TC0)     */
  TC0_CH2_IRQn              =  25, /**< 25  Timer/Counter 0 Channel 2 (TC0)     */
  TC1_CH0_IRQn              =  26, /**< 26  Timer/Counter 1 Channel 0 (TC1)     */
  TC1_CH1_IRQn              =  27, /**< 27  Timer/Counter 1 Channel 1 (TC1)     */
  TC1_CH2_IRQn              =  28, /**< 28  Timer/Counter 1 Channel 2 (TC1)     */
  AFEC0_IRQn                =  29, /**< 29  Analog Front-End Controller (AFEC0) */
  DACC_IRQn                 =  30, /**< 30  Digital-to-Analog Converter Controller (DACC) */
  PWM0_IRQn                 =  31, /**< 31  Pulse Width Modulation Controller (PWM0) */
  ICM_IRQn                  =  32, /**< 32  Integrity Check Monitor (ICM)       */
  ACC_IRQn                  =  33, /**< 33  Analog Comparator Controller (ACC)  */
  USBHS_IRQn                =  34, /**< 34  USB High-Speed Interface (USBHS)    */
  MCAN0_INT0_IRQn           =  35, /**< 35  Controller Area Network (MCAN0)     */
  MCAN0_INT1_IRQn           =  36, /**< 36  Controller Area Network (MCAN0)     */
  MCAN1_INT0_IRQn           =  37, /**< 37  Controller Area Network (MCAN1)     */
  MCAN1_INT1_IRQn           =  38, /**< 38  Controller Area Network (MCAN1)     */
  GMAC_IRQn                 =  39, /**< 39  Gigabit Ethernet MAC (GMAC)         */
  AFEC1_IRQn                =  40, /**< 40  Analog Front-End Controller (AFEC1) */
  TWIHS2_IRQn               =  41, /**< 41  Two-wire Interface High Speed (TWIHS2) */
  SPI1_IRQn                 =  42, /**< 42  Serial Peripheral Interface (SPI1)  */
  QSPI_IRQn                 =  43, /**< 43  Quad Serial Peripheral Interface (QSPI) */
  UART2_IRQn                =  44, /**< 44  Universal Asynchronous Receiver Transmitter (UART2) */
  UART3_IRQn                =  45, /**< 45  Universal Asynchronous Receiver Transmitter (UART3) */
  UART4_IRQn                =  46, /**< 46  Universal Asynchronous Receiver Transmitter (UART4) */
  TC2_CH0_IRQn              =  47, /**< 47  Timer/Counter 2 Channel 0 (TC2)     */
  TC2_CH1_IRQn              =  48, /**< 48  Timer/Counter 2 Channel 1 (TC2)     */
  TC2_CH2_IRQn              =  49, /**< 49  Timer/Counter 2 Channel 2 (TC2)     */
  TC3_CH0_IRQn              =  50, /**< 50  Timer/Counter 3 Channel 0 (TC3)     */
  TC3_CH1_IRQn              =  51, /**< 51  Timer/Counter 3 Channel 1 (TC3)     */
  TC3_CH2_IRQn              =  52, /**< 52  Timer/Counter 3 Channel 2 (TC3)     */
  AES_IRQn                  =  56, /**< 56  Advanced Encryption Standard (AES)  */
  TRNG_IRQn                 =  57, /**< 57  True Random Number Generator (TRNG) */
  XDMAC_IRQn                =  58, /**< 58  Extensible DMA Controller (XDMAC)   */
  ISI_IRQn                  =  59, /**< 59  Image Sensor Interface (ISI)        */
  PWM1_IRQn                 =  60, /**< 60  Pulse Width Modulation Controller (PWM1) */
  FPU_IRQn                  =  61, /**< 61  Floating Point Unit Registers (FPU) */
  SDRAMC_IRQn               =  62, /**< 62  SDRAM Controller (SDRAMC)           */
  RSWDT_IRQn                =  63, /**< 63  Reinforced Safety Watchdog Timer (RSWDT) */
  CCW_IRQn                  =  64, /**< 64  System Control Registers (SystemControl) */
  CCF_IRQn                  =  65, /**< 65  System Control Registers (SystemControl) */
  GMAC_Q1_IRQn              =  66, /**< 66  Gigabit Ethernet MAC (GMAC)         */
  GMAC_Q2_IRQn              =  67, /**< 67  Gigabit Ethernet MAC (GMAC)         */
  IXC_IRQn                  =  68, /**< 68  Floating Point Unit Registers (FPU) */
  I2SC0_IRQn                =  69, /**< 69  Inter-IC Sound Controller (I2SC0)   */
  I2SC1_IRQn                =  70, /**< 70  Inter-IC Sound Controller (I2SC1)   */
  GMAC_Q3_IRQn              =  71, /**< 71  Gigabit Ethernet MAC (GMAC)         */
  GMAC_Q4_IRQn              =  72, /**< 72  Gigabit Ethernet MAC (GMAC)         */
  GMAC_Q5_IRQn              =  73, /**< 73  Gigabit Ethernet MAC (GMAC)         */

  PERIPH_MAX_IRQn           =  73 /**< Number of peripheral IDs */
} IRQn_Type;

