Microchip-MPLAB-Harmony/net/apps/snmpv3_sdcard_fatfs/firmware/src/packs/ATSAME70Q19B_DFP/atsame70q19b.h
/*
 * \brief Configuration of the CORTEX-M7 Processor and Core Peripherals
 */
#define __CM7_REV                 0x0101 /**< CM7 Core Revision                                                         */
#define __NVIC_PRIO_BITS               3 /**< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0 /**< Set to 1 if different SysTick Config is used                              */
#define __MPU_PRESENT                  1 /**< MPU present or not                                                        */
#define __VTOR_PRESENT                 1 /**< Vector Table Offset Register present or not                               */
#define __FPU_PRESENT                  1 /**< FPU present or not                                                        */
#define __FPU_DP                       1 /**< Double Precision FPU                                                      */
#define __ICACHE_PRESENT               1 /**< Instruction Cache present                                                 */
#define __DCACHE_PRESENT               1 /**< Data Cache present                                                        */
#define __ITCM_PRESENT                 1 /**< Instruction TCM present                                                   */
#define __DTCM_PRESENT                 1 /**< Data TCM present                                                          */
#define __DEBUG_LVL                    1
#define __TRACE_LVL                    1
#define __ARCH_ARM                     1
#define __ARCH_ARM_CORTEX_M            1
#define __DEVICE_IS_SAM                1

/*
 * \brief CMSIS includes
 */
#include <core_cm7.h>

/** @}  end of SAME70Q19B_cmsis CMSIS Definitions */

/** \defgroup SAME70Q19B_api Peripheral Software API
 *  @{
 */

/* ************************************************************************** */
/**  SOFTWARE PERIPHERAL API DEFINITION FOR SAME70Q19B                        */
/* ************************************************************************** */
#include "component/acc.h"
#include "component/aes.h"
#include "component/afec.h"
#include "component/chipid.h"
#include "component/dacc.h"
#include "component/efc.h"
#include "component/gmac.h"
#include "component/gpbr.h"
#include "component/hsmci.h"
#include "component/i2sc.h"
#include "component/icm.h"
#include "component/isi.h"
#include "component/matrix.h"
#include "component/mcan.h"
#include "component/pio.h"
#include "component/pmc.h"
#include "component/pwm.h"
#include "component/qspi.h"
#include "component/rstc.h"
#include "component/rswdt.h"
#include "component/rtc.h"
#include "component/rtt.h"
#include "component/sdramc.h"
#include "component/smc.h"
#include "component/spi.h"
#include "component/ssc.h"
#include "component/supc.h"
#include "component/tc.h"
#include "component/trng.h"
#include "component/twihs.h"
#include "component/uart.h"
#include "component/usart.h"
#include "component/usbhs.h"
#include "component/utmi.h"
#include "component/wdt.h"
#include "component/xdmac.h"
/** @}  end of Peripheral Software API */

/** \addtogroup SAME70Q19B_id Peripheral Ids Definitions
 *  @{
 */

/* ************************************************************************** */
/*  PERIPHERAL ID DEFINITIONS FOR SAME70Q19B                                  */
/* ************************************************************************** */
#define ID_ACC           ( 33) /**< \brief Analog Comparator Controller (ACC) */
#define ID_AES           ( 56) /**< \brief Advanced Encryption Standard (AES) */
#define ID_AFEC0         ( 29) /**< \brief Analog Front-End Controller (AFEC0) */
#define ID_AFEC1         ( 40) /**< \brief Analog Front-End Controller (AFEC1) */
#define ID_DACC          ( 30) /**< \brief Digital-to-Analog Converter Controller (DACC) */
#define ID_EFC           (  6) /**< \brief Embedded Flash Controller (EFC) */
#define ID_GMAC          ( 39) /**< \brief Gigabit Ethernet MAC (GMAC) */
#define ID_HSMCI         ( 18) /**< \brief High Speed MultiMedia Card Interface (HSMCI) */
#define ID_I2SC0         ( 69) /**< \brief Inter-IC Sound Controller (I2SC0) */
#define ID_I2SC1         ( 70) /**< \brief Inter-IC Sound Controller (I2SC1) */
#define ID_ICM           ( 32) /**< \brief Integrity Check Monitor (ICM) */
#define ID_ISI           ( 59) /**< \brief Image Sensor Interface (ISI) */
#define ID_MCAN0         ( 35) /**< \brief Controller Area Network (MCAN0) */
#define ID_MCAN1         ( 37) /**< \brief Controller Area Network (MCAN1) */
#define ID_PIOA          ( 10) /**< \brief Parallel Input/Output Controller (PIOA) */
#define ID_PIOB          ( 11) /**< \brief Parallel Input/Output Controller (PIOB) */
#define ID_PIOC          ( 12) /**< \brief Parallel Input/Output Controller (PIOC) */
#define ID_PIOD          ( 16) /**< \brief Parallel Input/Output Controller (PIOD) */
#define ID_PIOE          ( 17) /**< \brief Parallel Input/Output Controller (PIOE) */
#define ID_PMC           (  5) /**< \brief Power Management Controller (PMC) */
#define ID_PWM0          ( 31) /**< \brief Pulse Width Modulation Controller (PWM0) */
#define ID_PWM1          ( 60) /**< \brief Pulse Width Modulation Controller (PWM1) */
#define ID_QSPI          ( 43) /**< \brief Quad Serial Peripheral Interface (QSPI) */
#define ID_RSTC          (  1) /**< \brief Reset Controller (RSTC) */
#define ID_RSWDT         ( 63) /**< \brief Reinforced Safety Watchdog Timer (RSWDT) */
#define ID_RTC           (  2) /**< \brief Real-time Clock (RTC) */
#define ID_RTT           (  3) /**< \brief Real-time Timer (RTT) */
#define ID_SDRAMC        ( 62) /**< \brief SDRAM Controller (SDRAMC) */
#define ID_SMC           (  9) /**< \brief Static Memory Controller (SMC) */
#define ID_SPI0          ( 21) /**< \brief Serial Peripheral Interface (SPI0) */
#define ID_SPI1          ( 42) /**< \brief Serial Peripheral Interface (SPI1) */
#define ID_SSC           ( 22) /**< \brief Synchronous Serial Controller (SSC) */
#define ID_TRNG          ( 57) /**< \brief True Random Number Generator (TRNG) */
#define ID_TWIHS0        ( 19) /**< \brief Two-wire Interface High Speed (TWIHS0) */
#define ID_TWIHS1        ( 20) /**< \brief Two-wire Interface High Speed (TWIHS1) */
#define ID_TWIHS2        ( 41) /**< \brief Two-wire Interface High Speed (TWIHS2) */
#define ID_UART0         (  7) /**< \brief Universal Asynchronous Receiver Transmitter (UART0) */
#define ID_UART1         (  8) /**< \brief Universal Asynchronous Receiver Transmitter (UART1) */
#define ID_UART2         ( 44) /**< \brief Universal Asynchronous Receiver Transmitter (UART2) */
#define ID_UART3         ( 45) /**< \brief Universal Asynchronous Receiver Transmitter (UART3) */
#define ID_UART4         ( 46) /**< \brief Universal Asynchronous Receiver Transmitter (UART4) */
#define ID_USART0        ( 13) /**< \brief Universal Synchronous Asynchronous Receiver Transmitter (USART0) */
#define ID_USART1        ( 14) /**< \brief Universal Synchronous Asynchronous Receiver Transmitter (USART1) */
#define ID_USART2        ( 15) /**< \brief Universal Synchronous Asynchronous Receiver Transmitter (USART2) */
#define ID_USBHS         ( 34) /**< \brief USB High-Speed Interface (USBHS) */
#define ID_WDT           (  4) /**< \brief Watchdog Timer (WDT) */
#define ID_XDMAC         ( 58) /**< \brief Extensible DMA Controller (XDMAC) */

#define ID_PERIPH_MAX  ( 71) /**< \brief Number of peripheral IDs */
/** @}  end of Peripheral Ids Definitions */

/** \addtogroup SAME70Q19B_base Peripheral Base Address Definitions
 *  @{
 */

/* ************************************************************************** */
/*   REGISTER STRUCTURE ADDRESS DEFINITIONS FOR SAME70Q19B                    */
/* ************************************************************************** */
#define ACC_REGS                         ((acc_registers_t*)0x40044000)                /**< \brief ACC Registers Address        */
#define AES_REGS                         ((aes_registers_t*)0x4006c000)                /**< \brief AES Registers Address        */
#define AFEC0_REGS                       ((afec_registers_t*)0x4003c000)               /**< \brief AFEC0 Registers Address      */
#define AFEC1_REGS                       ((afec_registers_t*)0x40064000)               /**< \brief AFEC1 Registers Address      */
#define CHIPID_REGS                      ((chipid_registers_t*)0x400e0940)             /**< \brief CHIPID Registers Address     */
#define DACC_REGS                        ((dacc_registers_t*)0x40040000)               /**< \brief DACC Registers Address       */
#define EFC_REGS                         ((efc_registers_t*)0x400e0c00)                /**< \brief EFC Registers Address        */
#define GMAC_REGS                        ((gmac_registers_t*)0x40050000)               /**< \brief GMAC Registers Address       */
#define GPBR_REGS                        ((gpbr_registers_t*)0x400e1890)               /**< \brief GPBR Registers Address       */
#define HSMCI_REGS                       ((hsmci_registers_t*)0x40000000)              /**< \brief HSMCI Registers Address      */
#define I2SC0_REGS                       ((i2sc_registers_t*)0x4008c000)               /**< \brief I2SC0 Registers Address      */
#define I2SC1_REGS                       ((i2sc_registers_t*)0x40090000)               /**< \brief I2SC1 Registers Address      */
#define ICM_REGS                         ((icm_registers_t*)0x40048000)                /**< \brief ICM Registers Address        */
#define ISI_REGS                         ((isi_registers_t*)0x4004c000)                /**< \brief ISI Registers Address        */
#define MATRIX_REGS                      ((matrix_registers_t*)0x40088000)             /**< \brief MATRIX Registers Address     */
#define MCAN0_REGS                       ((mcan_registers_t*)0x40030000)               /**< \brief MCAN0 Registers Address      */
#define MCAN1_REGS                       ((mcan_registers_t*)0x40034000)               /**< \brief MCAN1 Registers Address      */
#define PIOA_REGS                        ((pio_registers_t*)0x400e0e00)                /**< \brief PIOA Registers Address       */
#define PIOB_REGS                        ((pio_registers_t*)0x400e1000)                /**< \brief PIOB Registers Address       */
#define PIOC_REGS                        ((pio_registers_t*)0x400e1200)                /**< \brief PIOC Registers Address       */
#define PIOD_REGS                        ((pio_registers_t*)0x400e1400)                /**< \brief PIOD Registers Address       */
#define PIOE_REGS                        ((pio_registers_t*)0x400e1600)                /**< \brief PIOE Registers Address       */
#define PMC_REGS                         ((pmc_registers_t*)0x400e0600)                /**< \brief PMC Registers Address        */
#define PWM0_REGS                        ((pwm_registers_t*)0x40020000)                /**< \brief PWM0 Registers Address       */
#define PWM1_REGS                        ((pwm_registers_t*)0x4005c000)                /**< \brief PWM1 Registers Address       */
#define QSPI_REGS                        ((qspi_registers_t*)0x4007c000)               /**< \brief QSPI Registers Address       */
#define RSTC_REGS                        ((rstc_registers_t*)0x400e1800)               /**< \brief RSTC Registers Address       */
#define RSWDT_REGS                       ((rswdt_registers_t*)0x400e1900)              /**< \brief RSWDT Registers Address      */
#define RTC_REGS                         ((rtc_registers_t*)0x400e1860)                /**< \brief RTC Registers Address        */
#define RTT_REGS                         ((rtt_registers_t*)0x400e1830)                /**< \brief RTT Registers Address        */
#define SDRAMC_REGS                      ((sdramc_registers_t*)0x40084000)             /**< \brief SDRAMC Registers Address     */
#define SMC_REGS                         ((smc_registers_t*)0x40080000)                /**< \brief SMC Registers Address        */
#define SPI0_REGS                        ((spi_registers_t*)0x40008000)                /**< \brief SPI0 Registers Address       */
#define SPI1_REGS                        ((spi_registers_t*)0x40058000)                /**< \brief SPI1 Registers Address       */
#define SSC_REGS                         ((ssc_registers_t*)0x40004000)                /**< \brief SSC Registers Address        */
#define SUPC_REGS                        ((supc_registers_t*)0x400e1810)               /**< \brief SUPC Registers Address       */
#define TC0_REGS                         ((tc_registers_t*)0x4000c000)                 /**< \brief TC0 Registers Address        */
#define TC1_REGS                         ((tc_registers_t*)0x40010000)                 /**< \brief TC1 Registers Address        */
#define TC2_REGS                         ((tc_registers_t*)0x40014000)                 /**< \brief TC2 Registers Address        */
#define TC3_REGS                         ((tc_registers_t*)0x40054000)                 /**< \brief TC3 Registers Address        */
#define TRNG_REGS                        ((trng_registers_t*)0x40070000)               /**< \brief TRNG Registers Address       */
#define TWIHS0_REGS                      ((twihs_registers_t*)0x40018000)              /**< \brief TWIHS0 Registers Address     */
#define TWIHS1_REGS                      ((twihs_registers_t*)0x4001c000)              /**< \brief TWIHS1 Registers Address     */
#define TWIHS2_REGS                      ((twihs_registers_t*)0x40060000)              /**< \brief TWIHS2 Registers Address     */
#define UART0_REGS                       ((uart_registers_t*)0x400e0800)               /**< \brief UART0 Registers Address      */
#define UART1_REGS                       ((uart_registers_t*)0x400e0a00)               /**< \brief UART1 Registers Address      */
#define UART2_REGS                       ((uart_registers_t*)0x400e1a00)               /**< \brief UART2 Registers Address      */
#define UART3_REGS                       ((uart_registers_t*)0x400e1c00)               /**< \brief UART3 Registers Address      */
#define UART4_REGS                       ((uart_registers_t*)0x400e1e00)               /**< \brief UART4 Registers Address      */
#define USART0_REGS                      ((usart_registers_t*)0x40024000)              /**< \brief USART0 Registers Address     */
#define USART1_REGS                      ((usart_registers_t*)0x40028000)              /**< \brief USART1 Registers Address     */
#define USART2_REGS                      ((usart_registers_t*)0x4002c000)              /**< \brief USART2 Registers Address     */
#define USBHS_REGS                       ((usbhs_registers_t*)0x40038000)              /**< \brief USBHS Registers Address      */
#define UTMI_REGS                        ((utmi_registers_t*)0x400e0400)               /**< \brief UTMI Registers Address       */
#define WDT_REGS                         ((wdt_registers_t*)0x400e1850)                /**< \brief WDT Registers Address        */
#define XDMAC_REGS                       ((xdmac_registers_t*)0x40078000)              /**< \brief XDMAC Registers Address      */

/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR SAME70Q19B                                  */
/* ************************************************************************** */

#define ACC_BASE_ADDRESS                 (0x40044000UL)                                /**< \brief ACC Base Address             */
#define AES_BASE_ADDRESS                 (0x4006c000UL)                                /**< \brief AES Base Address             */
#define AFEC0_BASE_ADDRESS               (0x4003c000UL)                                /**< \brief AFEC0 Base Address           */
#define AFEC1_BASE_ADDRESS               (0x40064000UL)                                /**< \brief AFEC1 Base Address           */
#define CHIPID_BASE_ADDRESS              (0x400e0940UL)                                /**< \brief CHIPID Base Address          */
#define DACC_BASE_ADDRESS                (0x40040000UL)                                /**< \brief DACC Base Address            */
#define EFC_BASE_ADDRESS                 (0x400e0c00UL)                                /**< \brief EFC Base Address             */
#define GMAC_BASE_ADDRESS                (0x40050000UL)                                /**< \brief GMAC Base Address            */
#define GPBR_BASE_ADDRESS                (0x400e1890UL)                                /**< \brief GPBR Base Address            */
#define HSMCI_BASE_ADDRESS               (0x40000000UL)                                /**< \brief HSMCI Base Address           */
#define I2SC0_BASE_ADDRESS               (0x4008c000UL)                                /**< \brief I2SC0 Base Address           */
#define I2SC1_BASE_ADDRESS               (0x40090000UL)                                /**< \brief I2SC1 Base Address           */
#define ICM_BASE_ADDRESS                 (0x40048000UL)                                /**< \brief ICM Base Address             */
#define ISI_BASE_ADDRESS                 (0x4004c000UL)                                /**< \brief ISI Base Address             */
#define MATRIX_BASE_ADDRESS              (0x40088000UL)                                /**< \brief MATRIX Base Address          */
#define MCAN0_BASE_ADDRESS               (0x40030000UL)                                /**< \brief MCAN0 Base Address           */
#define MCAN1_BASE_ADDRESS               (0x40034000UL)                                /**< \brief MCAN1 Base Address           */
#define PIOA_BASE_ADDRESS                (0x400e0e00UL)                                /**< \brief PIOA Base Address            */
#define PIOB_BASE_ADDRESS                (0x400e1000UL)                                /**< \brief PIOB Base Address            */
#define PIOC_BASE_ADDRESS                (0x400e1200UL)                                /**< \brief PIOC Base Address            */
#define PIOD_BASE_ADDRESS                (0x400e1400UL)                                /**< \brief PIOD Base Address            */
#define PIOE_BASE_ADDRESS                (0x400e1600UL)                                /**< \brief PIOE Base Address            */
#define PMC_BASE_ADDRESS                 (0x400e0600UL)                                /**< \brief PMC Base Address             */
#define PWM0_BASE_ADDRESS                (0x40020000UL)                                /**< \brief PWM0 Base Address            */
#define PWM1_BASE_ADDRESS                (0x4005c000UL)                                /**< \brief PWM1 Base Address            */
#define QSPI_BASE_ADDRESS                (0x4007c000UL)                                /**< \brief QSPI Base Address            */
#define RSTC_BASE_ADDRESS                (0x400e1800UL)                                /**< \brief RSTC Base Address            */
#define RSWDT_BASE_ADDRESS               (0x400e1900UL)                                /**< \brief RSWDT Base Address           */
#define RTC_BASE_ADDRESS                 (0x400e1860UL)                                /**< \brief RTC Base Address             */
#define RTT_BASE_ADDRESS                 (0x400e1830UL)                                /**< \brief RTT Base Address             */
#define SDRAMC_BASE_ADDRESS              (0x40084000UL)                                /**< \brief SDRAMC Base Address          */
#define SMC_BASE_ADDRESS                 (0x40080000UL)                                /**< \brief SMC Base Address             */
#define SPI0_BASE_ADDRESS                (0x40008000UL)                                /**< \brief SPI0 Base Address            */
#define SPI1_BASE_ADDRESS                (0x40058000UL)                                /**< \brief SPI1 Base Address            */
#define SSC_BASE_ADDRESS                 (0x40004000UL)                                /**< \brief SSC Base Address             */
#define SUPC_BASE_ADDRESS                (0x400e1810UL)                                /**< \brief SUPC Base Address            */
#define TC0_BASE_ADDRESS                 (0x4000c000UL)                                /**< \brief TC0 Base Address             */
#define TC1_BASE_ADDRESS                 (0x40010000UL)                                /**< \brief TC1 Base Address             */
#define TC2_BASE_ADDRESS                 (0x40014000UL)                                /**< \brief TC2 Base Address             */
#define TC3_BASE_ADDRESS                 (0x40054000UL)                                /**< \brief TC3 Base Address             */
#define TRNG_BASE_ADDRESS                (0x40070000UL)                                /**< \brief TRNG Base Address            */
#define TWIHS0_BASE_ADDRESS              (0x40018000UL)                                /**< \brief TWIHS0 Base Address          */
#define TWIHS1_BASE_ADDRESS              (0x4001c000UL)                                /**< \brief TWIHS1 Base Address          */
#define TWIHS2_BASE_ADDRESS              (0x40060000UL)                                /**< \brief TWIHS2 Base Address          */
#define UART0_BASE_ADDRESS               (0x400e0800UL)                                /**< \brief UART0 Base Address           */
#define UART1_BASE_ADDRESS               (0x400e0a00UL)                                /**< \brief UART1 Base Address           */
#define UART2_BASE_ADDRESS               (0x400e1a00UL)                                /**< \brief UART2 Base Address           */
#define UART3_BASE_ADDRESS               (0x400e1c00UL)                                /**< \brief UART3 Base Address           */
#define UART4_BASE_ADDRESS               (0x400e1e00UL)                                /**< \brief UART4 Base Address           */
#define USART0_BASE_ADDRESS              (0x40024000UL)                                /**< \brief USART0 Base Address          */
#define USART1_BASE_ADDRESS              (0x40028000UL)                                /**< \brief USART1 Base Address          */
#define USART2_BASE_ADDRESS              (0x4002c000UL)                                /**< \brief USART2 Base Address          */
#define USBHS_BASE_ADDRESS               (0x40038000UL)                                /**< \brief USBHS Base Address           */
#define UTMI_BASE_ADDRESS                (0x400e0400UL)                                /**< \brief UTMI Base Address            */
#define WDT_BASE_ADDRESS                 (0x400e1850UL)                                /**< \brief WDT Base Address             */
#define XDMAC_BASE_ADDRESS               (0x40078000UL)                                /**< \brief XDMAC Base Address           */

/** \addtogroup SAME70Q19B_pio Peripheral Pio Definitions
 *  @{
 */

/* ************************************************************************** */
/*   PIO DEFINITIONS FOR SAME70Q19B                                           */
/* ************************************************************************** */
#include "pio/same70q19b.h"
/** @}  end of Peripheral Pio Definitions */

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR SAME70Q19B                                */
/* ************************************************************************** */

