Microchip-MPLAB-Harmony/net/apps/snmpv3_sdcard_fatfs/firmware/src/packs/ATSAME70Q19B_DFP/atsame70q19b.h
#define PERIPHERALS_SIZE               (0x20000000UL)      /* 524288kB Memory segment type: io */
#define SYSTEM_SIZE                    (0x10000000UL)      /* 262144kB Memory segment type: io */
#define QSPIMEM_SIZE                   (0x20000000UL)      /* 524288kB Memory segment type: other */
#define AXIMX_SIZE                     (0x00100000UL)      /* 1024kB Memory segment type: other */
#define ITCM_SIZE                      (0x00200000UL)      /* 2048kB Memory segment type: other */
#define IFLASH_SIZE                    (0x00080000UL)      /*  512kB Memory segment type: flash */
#define IFLASH_PAGE_SIZE               (0x00000200UL)
#define IFLASH_NB_OF_PAGES             (0x00000400UL)
#define IROM_SIZE                      (0x00004000UL)      /*   16kB Memory segment type: rom */
#define DTCM_SIZE                      (0x00020000UL)      /*  128kB Memory segment type: other */
#define IRAM_SIZE                      (0x00040000UL)      /*  256kB Memory segment type: ram */
#define EBI_CS0_SIZE                   (0x01000000UL)      /* 16384kB Memory segment type: other */
#define EBI_CS1_SIZE                   (0x01000000UL)      /* 16384kB Memory segment type: other */
#define EBI_CS2_SIZE                   (0x01000000UL)      /* 16384kB Memory segment type: other */
#define EBI_CS3_SIZE                   (0x01000000UL)      /* 16384kB Memory segment type: other */
#define SDRAM_CS_SIZE                  (0x10000000UL)      /* 262144kB Memory segment type: other */
#define PERIPHERALS_ADDR               (0x40000000UL)      /**< PERIPHERALS base address (type: io) */
#define SYSTEM_ADDR                    (0xe0000000UL)      /**< SYSTEM base address (type: io) */
#define QSPIMEM_ADDR                   (0x80000000UL)      /**< QSPIMEM base address (type: other) */
#define AXIMX_ADDR                     (0xa0000000UL)      /**< AXIMX base address (type: other) */
#define ITCM_ADDR                      (0x00000000UL)      /**< ITCM base address (type: other) */
#define IFLASH_ADDR                    (0x00400000UL)      /**< IFLASH base address (type: flash) */
#define IROM_ADDR                      (0x00800000UL)      /**< IROM base address (type: rom) */
#define DTCM_ADDR                      (0x20000000UL)      /**< DTCM base address (type: other) */
#define IRAM_ADDR                      (0x20400000UL)      /**< IRAM base address (type: ram) */
#define EBI_CS0_ADDR                   (0x60000000UL)      /**< EBI_CS0 base address (type: other) */
#define EBI_CS1_ADDR                   (0x61000000UL)      /**< EBI_CS1 base address (type: other) */
#define EBI_CS2_ADDR                   (0x62000000UL)      /**< EBI_CS2 base address (type: other) */
#define EBI_CS3_ADDR                   (0x63000000UL)      /**< EBI_CS3 base address (type: other) */
#define SDRAM_CS_ADDR                  (0x70000000UL)      /**< SDRAM_CS base address (type: other) */

/* ************************************************************************** */
/**  DEVICE SIGNATURES FOR SAME70Q19B                                         */
/* ************************************************************************** */
#define CHIP_JTAGID                    (0x05b3d03fUL)
#define CHIP_CIDR                      (0xa10d0a01UL)
#define CHIP_EXID                      (0x00000002UL)

/* ************************************************************************** */
/**  ELECTRICAL DEFINITIONS FOR SAME70Q19B                                    */
/* ************************************************************************** */
#define CHIP_FREQ_SLCK_RC_MIN               (20000UL)
#define CHIP_FREQ_SLCK_RC                   (32000UL)      /**< \brief Typical Slow Clock Internal RC frequency */
#define CHIP_FREQ_SLCK_RC_MAX               (44000UL)
#define CHIP_FREQ_MAINCK_RC_4MHZ          (4000000UL)
#define CHIP_FREQ_MAINCK_RC_8MHZ          (8000000UL)
#define CHIP_FREQ_MAINCK_RC_12MHZ        (12000000UL)
#define CHIP_FREQ_CPU_MAX               (300000000UL)
#define CHIP_FREQ_XTAL_32K                  (32768UL)
#define CHIP_FREQ_XTAL_12M               (12000000UL)
#define CHIP_FREQ_FWS_0                  (23000000UL)      /**< \brief Maximum operating frequency when FWS is 0 */
#define CHIP_FREQ_FWS_1                  (46000000UL)      /**< \brief Maximum operating frequency when FWS is 1 */
#define CHIP_FREQ_FWS_2                  (69000000UL)      /**< \brief Maximum operating frequency when FWS is 2 */
#define CHIP_FREQ_FWS_3                  (92000000UL)      /**< \brief Maximum operating frequency when FWS is 3 */
#define CHIP_FREQ_FWS_4                 (115000000UL)      /**< \brief Maximum operating frequency when FWS is 4 */
#define CHIP_FREQ_FWS_5                 (138000000UL)      /**< \brief Maximum operating frequency when FWS is 5 */
#define CHIP_FREQ_FWS_6                 (150000000UL)      /**< \brief Maximum operating frequency when FWS is 6 */
#define CHIP_FREQ_FWS_NUMBER                    (7UL)      /**< \brief Number of FWS ranges */

#ifdef __cplusplus
}
#endif

/** @}  end of SAME70Q19B definitions */

#endif /* SAME70Q19B_H */

